app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."type" IN ('Role')
---
  def index
    @roles = Role.all