app/controllers/units_controller.rb

  def index
    setLogActivity("Open index")
    @units = Unit.all
---
SELECT "units".* FROM "units"