app/views/layouts/_left_panel.html.erb

SELECT *, products.id AS product_id FROM "products" LEFT OUTER JOIN "disiplines" ON "disiplines"."id" = "products"."disipline_id" WHERE "products"."disipline_id" = $1  [["disipline_id", 23]]
---
              <ul>
                <% @getProduct = Product.left_outer_joins(:disipline).where(disipline_id: f.id).select('*, products.id AS product_id') %>

SELECT name_type, types.id AS type_id FROM "types" LEFT OUTER JOIN "disiplines" ON "disiplines"."id" = "types"."disipline_id" WHERE (product_id = 1122 and disipline_id = 22) GROUP BY types.id
---
                    <ul>
                      <% @getType = Type.left_outer_joins(:disipline).where('product_id = ? and disipline_id = ?', f.product_id, f.disipline_id).select('name_type, types.id AS type_id').group('types.id') %>